brew "awscli"
brew "bat"
brew "cmake"
brew "colordiff"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "docker"
brew "docutils"
brew "duckdb"
brew "fastly/tap/fastly"
brew "flyctl"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-lfs"
brew "git"
brew "go"
brew "gron"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "mecab-ipadic"
brew "mecab"
brew "perl"
brew "pnpm"
brew "postgresql@14"
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "starship"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "vim"
brew "wget"
brew "xh"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"
cask "font-hack-nerd-font"
cask "forticlient"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "pritunl"
tap "fastly/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "supabase/tap"
vscode "adpyke.vscode-sql-formatter"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fastly.vscode-fastly-vcl"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "GraphQL.vscode-graphql"
vscode "hashicorp.terraform"
vscode "jakob101.RelativePath"
vscode "Jarga.apib"
vscode "jebbs.plantuml"
vscode "kortina.vscode-markdown-notes"
vscode "marclipovsky.string-manipulation"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "thomas-baumgaertner.vcl"
vscode "vadimcn.vscode-lldb"
vscode "yzhang.markdown-all-in-one"
vscode "ZixuanChen.vitest-explorer"
vscode "zxh404.vscode-proto3"
