tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'go-delve/delve'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'neovim/neovim'
cask 'xquartz'
brew 'autoconf'
brew 'automake'
brew 'browser'
brew 'cmake'
brew 'coreutils'
brew 'direnv'
brew 'dos2unix'
brew 'openssl', args: ['universal']
brew 'jpeg', args: ['universal']
brew 'libpng', args: ['universal']
brew 'libtiff', args: ['universal']
brew 'erlang'
brew 'fswatch'
brew 'git'
brew 'ghq'
brew 'git-extras'
brew 'git-flow'
brew 'go'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'googler'
brew 'libtool', args: ['universal']
brew 'graphicsmagick'
brew 'graphviz'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jasper', args: ['universal']
brew 'jq'
brew 'mas'
brew 'mysql'
brew 'numpy'
brew 'openexr'
brew 'pcre'
brew 'passenger'
brew 'peco'
brew 'pkg-config'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rename'
brew 'rlwrap'
brew 'ruby'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'yarn'
brew 'zsh'
brew 'go-delve/delve/delve'
brew 'homebrew/boneyard/rsense'
brew 'homebrew/science/opencv'
brew 'neovim/neovim/neovim'
cask 'bettertouchtool'
cask 'dropbox'
cask 'flux'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'kindle'
cask 'seil'
cask 'vagrant'
cask 'virtualbox'
