# Homebrew taps

# === Core Development Tools ===
brew "git"
brew "git-absorb"      # Automatically absorb fixup commits

# === Text Processing ===
brew "fd"              # Fast file finder (used by telescope.nvim)
brew "rename"          # Bulk file renaming

# === Development Environment ===
brew "zsh"             # Modern shell (plugins managed by sheldon)

# === Desktop Applications ===
cask "font-hack-nerd-font"    # Programming font with icons
cask "google-japanese-ime"    # Japanese input method
cask "karabiner-elements"     # Keyboard customization

# === VS Code Extensions ===
# Essential core extensions
vscode "ms-vscode.vscode-json"              # JSON language support
vscode "EditorConfig.EditorConfig"          # Consistent coding styles

# Language support - Other languages
vscode "golang.go"                          # Go language support
vscode "rust-lang.rust-analyzer"            # Rust language support
vscode "bradlc.vscode-tailwindcss"          # Tailwind CSS support

# JavaScript/TypeScript tooling
vscode "esbenp.prettier-vscode"             # Code formatter
vscode "dbaeumer.vscode-eslint"             # JavaScript/TypeScript linter

# Git and version control
vscode "github.vscode-github-actions"       # GitHub Actions support

# Shell and system tools
vscode "foxundermoon.shell-format"          # Shell script formatter
vscode "ms-vscode.makefile-tools"           # Makefile support

# Themes and UI enhancements
vscode "GitHub.github-vscode-theme"         # GitHub color theme
vscode "PKief.material-icon-theme"          # Material design icons
