# Homebrew taps

# === Core Development Tools ===
# Version control and repository management
brew "git"
brew "git-absorb"      # Automatically absorb fixup commits
brew "gh"              # GitHub CLI
brew "ghq"             # Git repository organizer
brew "tig"             # Text-mode Git interface

# Programming languages and runtimes
brew "go"              # Go programming language
brew "deno"            # JavaScript/TypeScript runtime

# Build tools and dependencies
brew "cmake"           # Cross-platform build system
brew "protobuf"        # Protocol buffers

# === Text Processing & File Operations ===
# Enhanced file listing and searching
brew "bat"             # Syntax highlighting cat replacement
brew "eza"             # Modern ls replacement
brew "ripgrep"         # Fast text search
brew "fzf"             # Fuzzy finder
brew "rename"          # Bulk file renaming
brew "tokei"           # Code statistics

# Text processing utilities
brew "jq"              # JSON processor

# === Package Management ===
brew "pnpm"            # Fast Node.js package manager

# === Development Environment ===
# Shell and terminal enhancements
brew "zsh"             # Modern shell (plugins managed by sheldon)
brew "starship"        # Cross-shell prompt
brew "sheldon"         # Zsh plugin manager
brew "tmux"            # Terminal multiplexer

# Editors
brew "neovim"          # Modern Vim

# === Code Quality & DevOps ===
brew "pre-commit"      # Git pre-commit hooks
brew "shellcheck"      # Shell script linter

# === Cloud & Infrastructure ===
brew "awscli"          # AWS command line interface
brew "kubernetes-cli"  # Kubernetes command line tool

# === Network & Download Tools ===
brew "xh"              # Modern HTTP client

# === Desktop Applications ===
# Fonts
cask "font-hack-nerd-font"    # Programming font with icons

# Input methods and system utilities
cask "google-japanese-ime"    # Japanese input method
cask "karabiner-elements"     # Keyboard customization
# === VS Code Extensions ===
# Essential core extensions
vscode "ms-vscode-remote.remote-ssh"        # Remote SSH development
vscode "ms-vscode-remote.remote-containers" # Dev containers support
vscode "ms-vscode.vscode-json"              # JSON language support
vscode "EditorConfig.EditorConfig"          # Consistent coding styles

# Language support - Python
vscode "ms-python.python"                   # Python language support
vscode "charliermarsh.ruff"                 # Python linter & formatter (replaces black + flake8)
vscode "ms-python.vscode-pylance"           # Advanced Python language server

# Language support - Other languages
vscode "golang.go"                          # Go language support
vscode "rust-lang.rust-analyzer"            # Rust language support
vscode "bradlc.vscode-tailwindcss"          # Tailwind CSS support

# JavaScript/TypeScript tooling
vscode "esbenp.prettier-vscode"             # Code formatter
vscode "dbaeumer.vscode-eslint"             # JavaScript/TypeScript linter

# Git and version control
vscode "eamodio.gitlens"                    # Enhanced Git capabilities
vscode "github.vscode-github-actions"       # GitHub Actions support
vscode "GitHub.copilot-chat"                # AI chat interface

# Documentation and writing
vscode "yzhang.markdown-all-in-one"         # Markdown editing
vscode "DavidAnson.vscode-markdownlint"     # Markdown linter

# Shell and system tools
vscode "foxundermoon.shell-format"          # Shell script formatter
vscode "ms-vscode.makefile-tools"           # Makefile support

# Themes and UI enhancements
vscode "GitHub.github-vscode-theme"         # GitHub color theme
vscode "PKief.material-icon-theme"          # Material design icons

# Development and collaboration tools
vscode "ms-vsliveshare.vsliveshare"         # Live collaboration
vscode "humao.rest-client"                  # HTTP client
vscode "ms-azuretools.vscode-docker"        # Docker integration
