oh-my-fish/plugin-argu
oh-my-fish/plugin-balias
edc/bass
oh-my-fish/theme-default
oh-my-fish/plugin-direnv
oh-my-fish/plugin-expand
fisherman/getopts
fisherman/git_util
oh-my-fish/plugin-peco
tsu-nera/fish-peco_recentd
yoshiori/fish-peco_select_ghq_repository
fisherman/z
